Repository: newbienetcore/full-toping
Catalog: learn-microservices/src/Services/Catalog/Catalog.Application/Properties/Resources.*.resx
Languages: vi_vn

source: Supplier does not exist or was deleted
vi_vn: Nhà cung cấp không tồn tại hoặc đã bị xóa

# supplier_is_duplicate_name
source: Supplier with this name already exists
vi_vn: Tên nhà cung cấp đã tồn tại

# fax_max_length_50
source: Fax number must not exceed 50 characters
vi_vn: Số fax không vượt quá 50 ký tự

# district_code_max_length_10
source: District code must not exceed 10 characters
vi_vn: Mã quận/huyện không vượt quá 10 ký tự

# bank_max_length_50
source: Bank name must not exceed 50 characters
vi_vn: Tên ngân hàng không vượt quá 50 ký tự

# bank_address_max_length_255
source: Bank address must not exceed 255 characters
vi_vn: Địa chỉ ngân hàng không vượt quá 255 ký tự

# account_number_max_length_50
source: Account number must not exceed 50 characters
vi_vn: Số tài khoản không vượt quá 50 ký tự

# province_code_max_length_10
source: Province code must not exceed 10 characters
vi_vn: Mã tỉnh/thành phố không vượt quá 10 ký tự

# nation_code_max_length_10
source: Nation code must not exceed 10 characters
vi_vn: Mã quốc gia không vượt quá 10 ký tự

# supplier_code_max_length_50
source: Supplier code must not exceed 50 characters
vi_vn: Mã nhà cung cấp không vượt quá 50 ký tự

# supplier_address_required
source: Supplier address is required
vi_vn: Địa chỉ nhà cung cấp là bắt buộc

# supplier_address_max_length_255
source: Supplier address must not exceed 255 characters
vi_vn: Địa chỉ nhà cung cấp không vượt quá 255 ký tự

# supplier_code_required
source: Supplier code is required
vi_vn: Mã nhà cung cấp là bắt buộc

# supplier_delegate_required
source: Supplier delegate is required
vi_vn: Tên đại diện nhà cung cấp là bắt buộc

# supplier_delegate_max_length_50
source: Supplier delegate must not exceed 50 characters
vi_vn: Tên đại diện nhà cung cấp không vượt quá 50 ký tự

# supplier_name_required
source: Supplier name is required
vi_vn: Tên nhà cung cấp là bắt buộc

# supplier_name_max_length_255
source: Supplier name must not exceed 255 characters
vi_vn: Tên nhà cung cấp không vượt quá 255 ký tự

# common_payload_is_not_valid
source: Request's payload is not valid
vi_vn: Gói tin không hợp lệ

# common_list_id_must_not_be_empty
source: List records need remove must not be empty
vi_vn: Danh sách bản ghi cần xóa không được để trống

# common_data_does_not_exist_or_was_deleted
source: This data does not exist or was deleted
vi_vn: Bản ghi không tồn tại hoặc đã bị xóa

source: Supplier id is invalid
vi_vn: Id nhà cung cấp không hợp lệ

# supplier_ids_is_valid
source: Supplier list id is invalid
vi_vn: Danh sách bản ghi cần xóa không hợp lệ

source: Upload image failed
vi_vn: Tải lên hình ảnh không thành công

# category_parent_invalid
source: Parent category is invalid or does not exist
vi_vn: Danh mục cha không hợp lệ hoặc không tồn tại

# category_parent_id_is_invalid
source: The parent category ID is invalid.
vi_vn: Mã của danh mục cha không hợp lệ.

source: Category order number must be greater than 0
vi_vn: Số thứ tự danh mục phải lớn hơn 0

# category_image_max_length_255
source: Maximum length for the file name is 255 characters
vi_vn: Độ dài tối đa của tên file là 255 ký tự

# category_image_required
source: Category image cannot be empty
vi_vn: Hình ảnh danh mục không được trống

# category_code_max_length_50
source: Category code must not exceed 50 characters
vi_vn: Mã danh mục không vượt quá 50 ký tự

# category_code_required
source: Category code is required
vi_vn: Mã danh mục là bắt buộc

# category_name_max_length_255
source: Category name must not exceed 255 characters
vi_vn: Tên danh mục không vượt quá 255 kí tự

# category_name_required
source: Category name is required
vi_vn: Tên nhà cung cấp là bắt buộc

# file_extension_is_not_valid
source: File is required
vi_vn: Tập tin không hợp lệ

# file_is_required
source: File extension is not valid
vi_vn: Phần mở rộng của tập tin không hợp lệ

source: File must be smaller than 4 MB
vi_vn: Dung lượng tập tin không được quá 4 MB

# supplier_is_duplicate_email
source: Supplier with this email already exists
vi_vn: Email nhà cung cấp đã tồn tại

# supplier_is_duplicate_phone
source: Supplier with this phone already exists
vi_vn: Số điện thoại nhà cung cấp đã tồn tại
